interface NavItem {
   title: string
   href: string
   children?: NavChild[]
}

interface NavChild {
   title: string
   href: string
   description?: string
}

const navItems: NavItem[] = [
   {
      title: "صفحه اصلی",
      href: "/",
   },
   {
      title: "خدمات ما",
      href: "#",
      children: [
         {
            title: "خدمات گمرکی",
            href: "#",
            description: "پیچیدگی های گمرکی خود را به متخصصین ما بسپارید",
         },
         {
            title: "خدمات خرید و تامین کالا",
            href: "#",
            description:
               "به راحتی کالای خود را انتخاب کنید و تعرفه آن را مشاهده نمایید",
         },
         {
            title: "خدمات حمل خارجی و داخلی",
            href: "#",
         },
         {
            title: "حدمات ارزی بازرگانی",
            href: "#",
         },
         {
            title: "خدمات بیمه",
            href: "#",
         },
         {
            title: "خدمات انبارداری و استریپ",
            href: "#",
         },
         {
            title: "خدمات تحقیق بازار صادراتی",
            href: "#",
         },
         {
            title: "خدمات استاندارد، بازرسی و ایزو",
            href: "#",
         },
         {
            title: "خدمات مشاوره و آموزش",
            href: "#",
         },
         {
            title: "خدمات بازاریابی بین الملل و مهندسی رشد محصول",
            href: "#",
         },
         {
            title: "خدمات مشارکت مالی و امور مالی بین الملل",
            href: "#",
         },
         {
            title: "خدمات نمایندگی و امور قرارداد",
            href: "#",
         },
         {
            title: "خدمات صندوق ضمانت صادرات",
            href: "#",
         },
         {
            title: "خدمات صادرات کالا",
            href: "#",
         },
         {
            title: "خدمات واردات کالا",
            href: "#",
         },
         {
            title: "خدمات ترخیص کالا",
            href: "#",
         },
      ],
   },
   {
      title: "تجارت بین الملل",
      href: "#",
      children: [
         {
            title: "بخش نامه های بازرگانی",
            href: "#",
         },
         {
            title: "فیلم های آموزشی",
            href: "#",
         },
         {
            title: "اصطلاحات بازرگانی",
            href: "#",
         },
      ],
   },
   {
      title: "سامانه های بازرگانی",
      href: "#",
      children: [
         {
            title: "سامانه جامع امور گمرکی",
            href: "#",
         },
         {
            title: "گمرک جمهوری اسلامی ایران",
            href: "#",
         },
         {
            title: "سامانه جامع مدیریت کالا و خدمات پس از ترخیص",
            href: "#",
         },
         {
            title: "سامانه جامع انبار ها و مراکز نگهداری کالا",
            href: "#",
         },
         {
            title: "سامانه قرنطینه",
            href: "#",
         },
         {
            title: "سامانه تنظیم مقررات رادیویی",
            href: "#",
         },
         {
            title: "سامانه انرژی اتمی",
            href: "#",
         },
         {
            title: "سامانه یکپارچه کارت بازرگانی هوشمند",
            href: "#",
         },
         {
            title: "سامانه جامع تجارت ایران",
            href: "#",
         },
         {
            title: "سامانه غذا و دارو",
            href: "#",
         },
         {
            title: "سامانه ارزی نیما",
            href: "#",
         },
      ],
   },
]

export default navItems
